run/navalFoam/twoDBoat6DOFGGI/0/alpha1.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1-dev                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object gamma;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bow
    {
        type            zeroGradient;
    }
    stern
    {
        type            zeroGradient;
    }
    hull
    {
        type            zeroGradient;
    }

    bargeSlider
    {
        type            ggi;
    }

    boxSlider
    {
        type            ggi;
    }

    left
    {
        type            fixedValue;
        value           uniform 0;
    }

    right
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
