run/navalFoam/twoDBoat6DOFGGI/0/motionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           tetPointVectorField;
    object          motionU;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    stern
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    hull
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bargeSlider
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    boxSlider
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    right
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    top
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
